"use srtict";

//Задача №1
//Що потрапить в консоль?

//let someVar = 0;
//++someVar;
//if (someVar) {
//console.log(someVar);
//}

//Пояснення: В консоль потрапить 1. ++ збільшує значення змінної з 0 до 1, 1 вважається правдивим значенням true.

//Задача №2
//За допомогою циклу FOR виведіть в консоль 10 рядків:
//Пункт №1
//Пункт №2
//і т.д.

//for (let i = 1; i <= 10; i++) {
//	console.log(`Пункт №${i}`);
//}

//Задача №3
//Що потрапить в консоль ?
//if (2 * 20 <= 10 || 30 / 2 < 5 && 10 <= "10" || 20 === "20") {
//console.log('000');
//}
// Пояснення: Нічого  не потрапить. Буде`false || false || false` що дасть `false`.

//Задача №4
//Створіть функцію, яка повертає результат ділення числа a на число b з додаванням рядка "Результат ділення: "
//Викличте функцію передаючі різні значення, у тому числі не передаючи зовсім.
//Функція не має повертати NaN, Infinite або помилку

//const result = (a, b) => {
//	const isNotAcceptableNumber = !Number.isFinite(a) || !Number.isFinite(b) || b === 0;

//	return isNotAcceptableNumber
//		? `Результат ділення: не можна виконати`
//		: `Результат ділення: ${a / b}`;
//};
//console.log(result(20, 50));
//console.log(result(10, 5));
//console.log(result(20, Infinity));
//console.log(result(Infinity, 5));
//console.log(result(15, 0));
//console.log(result());
//console.log(result("asdf", 5));

//Задача №5
//Створіть масив даних - 5 елементів, один з яких число 10
//Обробіть масив за допомогою методу перебору
//Перевіряйте елемент на відповідність числу 10, та у разі відповідності, виводьте в консоль

//const arr = [5, "text", 10, null, true];

//arr.forEach((item) => {
//	if (item === 10) {
//		console.log(`Знайдено: ${item}`);
//	}
//});
